alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
typedef struct {
    uint32_t periph; /* GPIOA..GPIOF base address. */
    uint32_t pin;    /* GPIO_PIN_n bit mask.       */
} gd32_gpio_pad_t;

static const gd32_gpio_pad_t gpio_pad_map[] = {
    { GPIOB, GPIO_PIN_10 }, /* bit  0 = E1M IO8  */
    { GPIOA, GPIO_PIN_7 },  /* bit  1 = E1M IO9  */
    { GPIOA, GPIO_PIN_12 }, /* bit  2 = E1M IO10 */
    { GPIOB, GPIO_PIN_0 },  /* bit  3 = E1M IO11 */
    { GPIOC, GPIO_PIN_1 },  /* bit  4 = E1M IO12 */
    { GPIOF, GPIO_PIN_1 },  /* bit  5 = E1M IO13 */
    { GPIOB, GPIO_PIN_5 },  /* bit  6 = E1M IO14 */
    { GPIOC, GPIO_PIN_0 },  /* bit  7 = E1M IO16 */
    { GPIOC, GPIO_PIN_14 }, /* bit  8 = E1M IO24 */
    { GPIOC, GPIO_PIN_15 }, /* bit  9 = E1M IO25 */
    { GPIOB, GPIO_PIN_11 }, /* bit 10 = E1M IO27 */
    { GPIOC, GPIO_PIN_2 },  /* bit 11 = E1M IO28 */
    { GPIOD, GPIO_PIN_11 }, /* bit 12 = E1M IO29 */
    { GPIOD, GPIO_PIN_10 }, /* bit 13 = E1M IO30 */
    { GPIOE, GPIO_PIN_12 }, /* bit 14 = E1M IO31 */
    { GPIOD, GPIO_PIN_2 },  /* bit 15 = E1M IO32 */
    { GPIOD, GPIO_PIN_8 },  /* bit 16 = E1M IO34 */
    { GPIOD, GPIO_PIN_1 },  /* bit 17 = E1M IO35 */
};
#define GPIO_PAD_MAP_COUNT (sizeof(gpio_pad_map) / sizeof(gpio_pad_map[0]))

/* Per-pad direction tracking.  Boot configures every pad as INPUT +
 * PULL_UP; bridge_hw_gpio_write() flips an entry to OUTPUT push-pull
 * on first call (sticky until the next chip reset).  Avoids the
 * need for a separate `CMD_GPIO_CONFIGURE` opcode -- read-only
 * callers see the external level until they touch the pad with a
 * write, after which subsequent reads return the driven level. */
static bool gpio_is_output[GPIO_PAD_MAP_COUNT];

/* ----------------------------------------------------------------- */
/* TRNG (NIST SP800-90B) state + bring-up.                            */
/* ----------------------------------------------------------------- */

/* Set true once bridge_hw_init() has confirmed the TRNG is producing
 * data and its hardware self-checks are clean.  bridge_hw_trng_read()
 * short-circuits to BRIDGE_HW_ERR_IO when this is false -- e.g. PLL
 * never stabilised, or the TRNG's analog noise source self-check
 * tripped CECS / SECS during bring-up. */
static bool trng_ready = false;

/* Coarse timeout for the PLL stable + TRNG DRDY polls.  Roughly
 * 100k iterations of `trng_flag_get` -- about half a millisecond
 * at the GD32G553's 240 MHz core clock when the TRNG is healthy
 * (DRDY trips in dozens of cycles, so the timeout is the abort
 * latch, not the typical-case bound). */
#define TRNG_INIT_TIMEOUT 100000u
#define TRNG_READY_TIMEOUT 65535u

/* One-time TRNG bring-up.  Configuration mirrors the vendor's
 * `TRNG_NIST_mode` example: PLL Q / 2 clock source, SHA-256
 * conditioning over a 440-bit input window, 256-bit output stage.
 * Returns true iff the TRNG produced its first DRDY without
 * tripping the clock-error (CECS) / seed-error (SECS) flags --
 * either of those fault states leaves the unit unable to deliver
 * randomness, and we surface that via `trng_ready = false`. */
static bool trng_bringup(void)
{
    uint32_t to;

    /* Vendor's `SystemInit()` (called from Reset_Handler before
     * main()) boots the PLL.  In normal operation PLLSTB is set by
     * the time we get here; bound the wait so a misconfigured
     * clock tree doesn't hang `bridge_hw_init`. */
    for (to = TRNG_INIT_TIMEOUT; to != 0u; --to) {
        if (SET == rcu_flag_get(RCU_FLAG_PLLSTB)) break;
    }
    if (to == 0u) return false;

    rcu_trng_clock_config(RCU_TRNG_CKPLLQ_DIV2);
    rcu_periph_clock_enable(RCU_TRNG);

    /* Self-tests on the analog noise source.  trng_clockerror_detection
     * arms the CECS flag so we'd see a clock outage during runtime. */
    trng_clockerror_detection_enable();

    trng_deinit();
    trng_conditioning_reset_enable();
    trng_mode_config(TRNG_MODSEL_NIST);
    trng_nist_seed_config(TRNG_NIST_SEED_ANALOG);
    trng_conditioning_input_bitwidth(TRNG_INMOD_440BIT);
    trng_conditioning_output_bitwidth(TRNG_OUTMOD_256BIT);
    trng_conditioning_algo_config(TRNG_ALGO_SHA256);
    trng_conditioning_enable();
    trng_postprocessing_enable();
    trng_enable();

    /* Wait for the first DRDY -- proves the noise source + post-
     * processing pipeline are alive.  Bounded -- if the analog
     * source is dead the unit will never trip DRDY. */
    for (to = TRNG_READY_TIMEOUT; to != 0u; --to) {
        if (SET == trng_flag_get(TRNG_FLAG_DRDY)) break;
    }
    if (to == 0u) return false;
    if (SET == trng_flag_get(TRNG_FLAG_CECS)) return false;
    if (SET == trng_flag_get(TRNG_FLAG_SECS)) return false;
    return true;
}

/* ----------------------------------------------------------------- */
/* TMU (CORDIC math accelerator) dispatch.                            */
/* ----------------------------------------------------------------- */

/* Per-host-function -> vendor TMU mode mapping.  Indexed by the wire
 * `function` byte (gd32g553_tmu_function_t in
 * `include/alp/chips/gd32g553.h`).  `mode = 0` is the NOSUPPORT
 * sentinel for the three host functions the GD32G5 TMU doesn't
 * natively support (tan / exp / tanh) -- the host wrapper can later
 * compose them via libm or via two TMU calls (tan = sin/cos,
 * tanh = sinh/cosh, exp = cosh + sinh) without protocol changes. */
typedef struct {
    uint32_t mode;   /* TMU_MODE_* (zero = NOSUPPORT marker)             */
    uint8_t  inputs; /* 1 or 2 inputs (zero matches NOSUPPORT entries)   */
} tmu_dispatch_t;

static const tmu_dispatch_t tmu_dispatch[] = {
    [0]  = { TMU_MODE_SIN, 2 },     /* sin(theta) -- HW computes m*sin(theta) */
    [1]  = { TMU_MODE_COS, 2 },     /* cos(theta) -- ditto                    */
    [2]  = { 0, 0 },                /* tan       -- NOSUPPORT                 */
    [3]  = { TMU_MODE_ATAN, 1 },    /* atan(x)                                */
    [4]  = { TMU_MODE_ATAN2, 2 },   /* atan2(y, x)                            */
    [5]  = { TMU_MODE_SQRT, 1 },    /* sqrt(x)                                */
    [6]  = { TMU_MODE_LN, 1 },      /* log = ln(x)                            */
    [7]  = { 0, 0 },                /* exp       -- NOSUPPORT                 */
    [8]  = { TMU_MODE_SINH, 1 },    /* sinh(x)                                */
    [9]  = { TMU_MODE_COSH, 1 },    /* cosh(x)                                */
    [10] = { 0, 0 },                /* tanh      -- NOSUPPORT                 */
    [11] = { TMU_MODE_MODULUS, 2 }, /* hypot = sqrt(x^2 + y^2)                */
};
#define TMU_DISPATCH_COUNT (sizeof(tmu_dispatch) / sizeof(tmu_dispatch[0]))

/* Timeout for the TMU END flag poll.  TMU operations complete in
 * tens of cycles at 240 MHz; the bound is the abort latch for a
 * misconfigured op rather than the typical-case wait. */
#define TMU_COMPUTE_TIMEOUT 65535u

