alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
/* Strict-aliasing-safe float<->u32 bit reinterpret helpers.  GCC
 * inlines these to bitcast instructions with -O1+. */
static float bits_to_f32(uint32_t b)
{
    float f;
    __builtin_memcpy(&f, &b, sizeof f);
    return f;
}
static uint32_t f32_to_bits(float f)
{
    uint32_t b;
    __builtin_memcpy(&b, &f, sizeof b);
    return b;
}

/* ----------------------------------------------------------------- */
/* ADC channels.                                                      */
/* ----------------------------------------------------------------- */

/* E1M ADC0..7 -> (ADC peripheral, channel index, pad).  Sourced from
 * maintainer-confirmed `metadata/e1m_modules/v2n/gd32-io-mcu-map.tsv`
 * with channel + peripheral assignments cross-checked against the
 * GD32G553xx datasheet pin alt-function summary:
 *
 *   E1M ADC0  PD9   ADC3  CH12
 *   E1M ADC1  PB12  ADC3  CH2
 *   E1M ADC2  PE13  ADC2  CH2
 *   E1M ADC3  PE11  ADC2  CH13
 *   E1M ADC4  PC4   ADC1  CH4
 *   E1M ADC5  PA5   ADC1  CH12
 *   E1M ADC6  PA2   ADC0  CH2
 *   E1M ADC7  PA3   ADC0  CH3
 *
 * All four ADC peripherals carry two of the eight channels; the
 * init loop brings up each ADC once and the read body reconfigures
 * the routine channel + triggers a single conversion on demand. */

typedef struct {
    uint32_t periph;    /* ADC0..ADC3 base                            */
    uint8_t  channel;   /* ADC_CHANNEL_n                              */
    uint32_t gpio_port; /* GPIOA..GPIOF                               */
    uint32_t gpio_pin;  /* GPIO_PIN_n                                 */
} gd32_adc_ch_t;

static const gd32_adc_ch_t adc_channels_map[] = {
    [0] = { ADC3, ADC_CHANNEL_12, GPIOD, GPIO_PIN_9 },
    [1] = { ADC3, ADC_CHANNEL_2, GPIOB, GPIO_PIN_12 },
    [2] = { ADC2, ADC_CHANNEL_2, GPIOE, GPIO_PIN_13 },
    [3] = { ADC2, ADC_CHANNEL_13, GPIOE, GPIO_PIN_11 },
    [4] = { ADC1, ADC_CHANNEL_4, GPIOC, GPIO_PIN_4 },
    [5] = { ADC1, ADC_CHANNEL_12, GPIOA, GPIO_PIN_5 },
    [6] = { ADC0, ADC_CHANNEL_2, GPIOA, GPIO_PIN_2 },
    [7] = { ADC0, ADC_CHANNEL_3, GPIOA, GPIO_PIN_3 },
};
#define ADC_CHANNEL_MAP_COUNT (sizeof(adc_channels_map) / sizeof(adc_channels_map[0]))

/* VREF for the ADC's 12-bit right-aligned code -> millivolt
 * conversion.  V2N's analog supply is 1.8 V (maintainer-confirmed
 * the same rail used by DAC_VREF_MV).  Full-scale is 4095 codes. */
#define ADC_VREF_MV 1800u
#define ADC_FULL_SCALE 4095u

/* Default sample time used for single-shot reads.  240 cycles is
 * the most conservative setting in the vendor's range -- gives the
 * external source plenty of settling time for a high-impedance
 * input divider, at the cost of slower conversion (~1 us per
 * sample at ADC_CLK_SYNC_HCLK_DIV6 with HCLK=240 MHz: 240 ADCCK
 * sample + 12.5 ADCCK conversion ~= 6.3 us). */
#define ADC_DEFAULT_SAMPLE_CYCLES 240u

/* Per-channel sticky sample-cycle override applied by
 * bridge_hw_adc_configure.  Defaults to ADC_DEFAULT_SAMPLE_CYCLES;
 * caller's tighter values (e.g. 24 cycles for low-impedance sources)
 * override on the next bridge_hw_adc_read.  Resolution + oversample
 * are still gated to defaults at v0.3 and live in a follow-up. */
static uint16_t adc_sample_cycles_cache[8];

static void adc_periph_init(uint32_t periph)
{
    adc_deinit(periph);
    adc_clock_config(periph, ADC_CLK_SYNC_HCLK_DIV6);
    adc_data_alignment_config(periph, ADC_DATAALIGN_RIGHT);
    adc_channel_length_config(periph, ADC_ROUTINE_CHANNEL, 1u);
    adc_external_trigger_config(periph, ADC_ROUTINE_CHANNEL, EXTERNAL_TRIGGER_DISABLE);
    adc_enable(periph);
}

/* ----------------------------------------------------------------- */
/* Quadrature encoder channels.                                       */
/* ----------------------------------------------------------------- */

/* E1M ENC0..3 -> (TIMER peripheral, X pad, Y pad, AF).  Each encoder
 * binds the underlying timer's CH0 + CH1 input-capture units as the
 * X / Y quadrature pair (decoder mode 2 -> X4 counts on both edges
 * of both inputs).  Maintainer-confirmed mapping:
 *
 *   E1M ENC0  X=PA0  Y=PB3  TIMER1  CH0/CH1  AF1
 *   E1M ENC1  X=PC6  Y=PC7  TIMER2  CH0/CH1  AF2
 *   E1M ENC2  X=PB6  Y=PB7  TIMER3  CH0/CH1  AF2
 *   E1M ENC3  X=PB2  Y=PA1  TIMER4  CH0/CH1  AF2
 *
 * TIMER1 + TIMER4 are 32-bit counters on the GD32G5x3; TIMER2 +
 * TIMER3 are 16-bit.  bridge_hw_qenc_read returns the raw counter
 * cast to int32_t -- the host handles wrap detection via deltas. */

typedef struct {
    uint32_t timer_periph;
    uint32_t gpio_x_port;
    uint32_t gpio_x_pin;
    uint32_t gpio_y_port;
    uint32_t gpio_y_pin;
    uint32_t gpio_af;
} gd32_qenc_t;

static const gd32_qenc_t qenc_map[] = {
    [0] = { TIMER1, GPIOA, GPIO_PIN_0, GPIOB, GPIO_PIN_3, GPIO_AF_1 },
    [1] = { TIMER2, GPIOC, GPIO_PIN_6, GPIOC, GPIO_PIN_7, GPIO_AF_2 },
    [2] = { TIMER3, GPIOB, GPIO_PIN_6, GPIOB, GPIO_PIN_7, GPIO_AF_2 },
    [3] = { TIMER4, GPIOB, GPIO_PIN_2, GPIOA, GPIO_PIN_1, GPIO_AF_2 },
};
#define QENC_CHANNEL_COUNT (sizeof(qenc_map) / sizeof(qenc_map[0]))

/* Per-encoder init.  Configures the X / Y pads as alt-function
 * inputs (pull-up so a disconnected encoder doesn't float), enables
 * the timer's clock, sets it up in quadrature decoder mode 2 (X4
 * counts on both edges of both inputs), and starts the counter. */
static void qenc_channel_init(const gd32_qenc_t *e)
{
    gpio_mode_set(e->gpio_x_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, e->gpio_x_pin);
    gpio_mode_set(e->gpio_y_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, e->gpio_y_pin);
    gpio_af_set(e->gpio_x_port, e->gpio_af, e->gpio_x_pin);
    gpio_af_set(e->gpio_y_port, e->gpio_af, e->gpio_y_pin);

    timer_parameter_struct ip;
    timer_struct_para_init(&ip);
    ip.prescaler         = 0u; /* count every encoder edge   */
    ip.alignedmode       = TIMER_COUNTER_EDGE;
    ip.counterdirection  = TIMER_COUNTER_UP;
    ip.period            = 0xFFFFFFFFu; /* 16-bit timers truncate     */
    ip.clockdivision     = TIMER_CKDIV_DIV1;
    ip.repetitioncounter = 0u;
    timer_deinit(e->timer_periph);
    timer_init(e->timer_periph, &ip);
    timer_quadrature_decoder_mode_config(e->timer_periph, TIMER_QUAD_DECODER_MODE2,
                                         TIMER_IC_POLARITY_RISING, TIMER_IC_POLARITY_RISING);
    timer_enable(e->timer_periph);
}

/* ----------------------------------------------------------------- */
/* PWM channels (TIMER0 + TIMER7).                                    */
/* ----------------------------------------------------------------- */

/* E1M PWM channel -> GD32 (timer, channel, output kind, pad, AF).
 * Sourced from `metadata/e1m_modules/v2n/gd32-io-mcu-map.tsv` for the
 * pad column; AF + timer-channel from the GD32G553xx Datasheet Rev2.0
 * Tables 2-10..2-13 (pin alternate-function summary).
 *
 *   PWM0  PA11  TIMER0_MCH0 (complement.) AF6
 *   PWM1  PB1   TIMER0_MCH2 (complement.) AF6
 *   PWM2  PB14  TIMER0_MCH1 (complement.) AF6
 *   PWM3  PC5   TIMER0_MCH3 (complement.) AF6
 *   PWM4  PC10  TIMER7_MCH0               AF4
 *   PWM5  PC11  TIMER7_MCH1               AF4
 *   PWM6  PC12  TIMER7_MCH2               AF4
 *   PWM7  PD0   TIMER7_MCH3               AF6
 *
 * Every PWM rides a distinct TIMER channel's complementary output,
 * so per-channel duty cycles are fully independent.  Each channel's
 * main output (CHx) is unused on V2N -- only the complementary
 * (CHxN) pad sits on the E1M PWM connector.
 *
 * Periods are SHARED across all PWMs of the same timer (TIMER0:
 * PWM0..3; TIMER7: PWM4..7) because each TIMER has one ARR.  The
 * per-channel `bridge_hw_pwm_set` body updates the timer's ARR every
 * call -- last write wins.  In typical V2N use the host sets the
 * same period across each group so this doesn't surface. */

