alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
typedef struct {
    uint32_t periph;     /* TIMER0 or TIMER7 base                          */
    uint16_t channel;    /* TIMER_CH_0..TIMER_CH_3                          */
    bool     complement; /* true: drive complementary output, false: main */
    uint32_t gpio_port;  /* GPIOA..GPIOF                                    */
    uint32_t gpio_pin;   /* GPIO_PIN_n                                     */
    uint32_t gpio_af;    /* GPIO_AF_X                                      */
} gd32_pwm_ch_t;

static const gd32_pwm_ch_t pwm_channels[] = {
    [0] = { TIMER0, TIMER_CH_0, true, GPIOA, GPIO_PIN_11, GPIO_AF_6 },
    [1] = { TIMER0, TIMER_CH_2, true, GPIOB, GPIO_PIN_1, GPIO_AF_6 },
    [2] = { TIMER0, TIMER_CH_1, true, GPIOB, GPIO_PIN_14, GPIO_AF_6 },
    [3] = { TIMER0, TIMER_CH_3, true, GPIOC, GPIO_PIN_5, GPIO_AF_6 },
    [4] = { TIMER7, TIMER_CH_0, true, GPIOC, GPIO_PIN_10, GPIO_AF_4 },
    [5] = { TIMER7, TIMER_CH_1, true, GPIOC, GPIO_PIN_11, GPIO_AF_4 },
    [6] = { TIMER7, TIMER_CH_2, true, GPIOC, GPIO_PIN_12, GPIO_AF_4 },
    [7] = { TIMER7, TIMER_CH_3, true, GPIOD, GPIO_PIN_0, GPIO_AF_6 },
};
#define PWM_CHANNEL_COUNT (sizeof(pwm_channels) / sizeof(pwm_channels[0]))

/* TIMER core clock.  GD32G553's stock SystemInit() clocks the
 * advanced timers from the APB-derived TIMER clock; on the chip's
 * default 240 MHz config that's 240 MHz at the timer counter input.
 * 1 ns LSB resolution would need a 240x faster counter; we instead
 * round period_ns + duty_ns to the nearest 1 us cycle by fixing the
 * prescaler at (240 - 1) so the counter ticks at 1 MHz.  ARR is
 * then `period_us - 1`, fitting in 16 bits for periods up to ~65 ms
 * which covers every realistic control PWM frequency (>=15 Hz). */
#define PWM_TIMER_CLK_HZ 240000000u
#define PWM_TIMER_PRESCALER (240u - 1u) /* 240 MHz -> 1 MHz tick    */
#define PWM_TIMER_TICK_NS 1000u         /* 1 us per timer tick      */
#define PWM_TIMER_ARR_MAX 0xFFFFu       /* 16-bit auto-reload limit */

/* Last-set cache for bridge_hw_pwm_get.  Reading back the timer's
 * compare register would also work but the caller is interested in
 * "what did I ask for", not "what does the rounded-to-1us value
 * round-trip to". */
static uint32_t pwm_period_ns_cache[PWM_CHANNEL_COUNT];
static uint32_t pwm_duty_ns_cache[PWM_CHANNEL_COUNT];

/* Per-timer init.  Called once per peripheral from bridge_hw_init();
 * Advanced timers need timer_primary_output_config(ENABLE) before any
 * output pin actually drives (vs basic timers, where the channel
 * enable is sufficient). */
static void pwm_timer_init(uint32_t periph)
{
    timer_parameter_struct ip;
    timer_struct_para_init(&ip);
    ip.prescaler         = (uint16_t)PWM_TIMER_PRESCALER;
    ip.alignedmode       = TIMER_COUNTER_EDGE;
    ip.counterdirection  = TIMER_COUNTER_UP;
    ip.period            = PWM_TIMER_ARR_MAX; /* 65.5 ms default; per-set */
    ip.clockdivision     = TIMER_CKDIV_DIV1;
    ip.repetitioncounter = 0u;
    timer_deinit(periph);
    timer_init(periph, &ip);
    timer_primary_output_config(periph, ENABLE);
    timer_enable(periph);
}

/* Per-channel init.  Sets PWM mode 0 (output high while counter <
 * compare) and 0 duty -- HW pad sits low until the host issues a
 * bridge_hw_pwm_set with a non-zero duty. */
static void pwm_channel_init(const gd32_pwm_ch_t *ch)
{
    timer_oc_parameter_struct oc;
    timer_channel_output_struct_para_init(&oc);
    if (ch->complement) {
        oc.outputstate  = TIMER_CCX_DISABLE;
        oc.outputnstate = TIMER_CCXN_ENABLE;
    } else {
        oc.outputstate  = TIMER_CCX_ENABLE;
        oc.outputnstate = TIMER_CCXN_DISABLE;
    }
    oc.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    oc.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    oc.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    oc.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    timer_channel_output_config(ch->periph, ch->channel, &oc);
    timer_channel_output_pulse_value_config(ch->periph, ch->channel, 0u);
    timer_channel_output_mode_config(ch->periph, ch->channel, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(ch->periph, ch->channel, TIMER_OC_SHADOW_DISABLE);
}

/* ----------------------------------------------------------------- */
/* DAC channels.                                                      */
/* ----------------------------------------------------------------- */

/* E1M DAC0/DAC1 -> physical DAC peripheral + output + pad.  Sourced
 * from `metadata/e1m_modules/v2n/gd32-io-mcu-map.tsv`; PA4 is the
 * GD32G5x3's stock DAC0_OUT0 alt-function and PA6 is DAC1_OUT0 per
 * the datasheet's pin alt-function table. */
typedef struct {
    uint32_t periph;    /* DAC0..DAC3 base address */
    uint8_t  out;       /* DAC_OUT0 or DAC_OUT1    */
    uint32_t gpio_port; /* GPIOA..GPIOG base addr  */
    uint32_t gpio_pin;  /* GPIO_PIN_n bit mask     */
} gd32_dac_ch_t;

static const gd32_dac_ch_t dac_channels[] = {
    [0] = { DAC0, DAC_OUT0, GPIOA, GPIO_PIN_4 }, /* E1M DAC0 -> PA4 */
    [1] = { DAC1, DAC_OUT0, GPIOA, GPIO_PIN_6 }, /* E1M DAC1 -> PA6 */
};
#define DAC_CHANNEL_COUNT (sizeof(dac_channels) / sizeof(dac_channels[0]))

/* DAC VREF.  The V2N's analog supply is 1.8 V (maintainer-confirmed
 * 2026-05-13 against the schematic).  Revisit if a future hw-revision
 * moves to a buffered VREFINT source or a different rail.  Full-scale
 * code is 4095 for 12-bit alignment; code = (value_mv * 4095) /
 * VREF_mV with overflow clamped. */
#define DAC_VREF_MV    1800u
#define DAC_FULL_SCALE 4095u

/* ----------------------------------------------------------------- */
/* Boot hooks (overrides of the weak defaults in src/main.c)         */
/* ----------------------------------------------------------------- */

/* Called once on entry to main() before the transport ISRs come
 * online.  Future commits also wire up the remaining peripherals
 * the bridge uses (TMU, ADC0..ADC3, DAC, TIMER0/7/19, the DA9292_INT
 * (P37)/DA9292_TW (P36) input pins -- the GD32's only DA9292
 * connections -- SysTick, etc.). */
void bridge_hw_init(void)
{
#if defined(BRIDGE_OTA_PARTITIONED) && defined(BRIDGE_APP_SLOT_BASE)
    /* OTA Path-A: the app runs from a flash slot, not 0x08000000, so move
     * the vector table off the vendor SystemInit default before any NVIC
     * use.  Runs first (main calls bridge_hw_init before the transports
     * enable interrupts). */
    SCB->VTOR = (uint32_t)(BRIDGE_APP_SLOT_BASE);
#endif

    /* Enable AHB2 clocks for every GPIO port the pad map references.
     * The chip's RCU keeps unused GPIO ports clock-gated to save
     * power; we enable A..F unconditionally because the E1M IO map
     * spans those ports.  Port G isn't referenced by any pad. */
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_GPIOD);
    rcu_periph_clock_enable(RCU_GPIOE);
    rcu_periph_clock_enable(RCU_GPIOF);

    /* Configure every entry in `gpio_pad_map` as INPUT + PULL_UP.
     * Safe default per the GPIO direction policy: no driven
     * contention with whatever the board might pull / drive on
     * those pads.  bridge_hw_gpio_write() promotes individual
     * pads to OUTPUT on demand. */
    for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
        gpio_mode_set(gpio_pad_map[i].periph, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP,
                      gpio_pad_map[i].pin);
        gpio_is_output[i] = false;
    }

    /* TRNG bring-up.  Failure (PLL never stable, analog noise
     * source bad, self-check tripped) leaves trng_ready = false;
     * bridge_hw_trng_read returns BRIDGE_HW_ERR_IO in that case
     * rather than serving zero-filled "randomness". */
    trng_ready = trng_bringup();

    /* TMU clock enable.  Per-op configuration happens in
     * bridge_hw_tmu_compute because the mode + I/O width vary per
     * call. */
    rcu_periph_clock_enable(RCU_TMU);

