alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
    /* DAC bring-up.  Two channels per `dac_channels[]`:
     *   ch0 -> DAC0_OUT0 -> PA4
     *   ch1 -> DAC1_OUT0 -> PA6
     * Configure both pads as analog (GPIOA clock was enabled
     * above for the IO pad map), enable each DAC peripheral in
     * NORMAL_PIN_BUFFON mode so the output drives the pad
     * through the chip's built-in buffer. */
    gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
    rcu_periph_clock_enable(RCU_DAC0);
    rcu_periph_clock_enable(RCU_DAC1);
    for (size_t i = 0; i < DAC_CHANNEL_COUNT; ++i) {
        dac_deinit(dac_channels[i].periph);
        dac_trigger_disable(dac_channels[i].periph, dac_channels[i].out);
        dac_wave_mode_config(dac_channels[i].periph, dac_channels[i].out, DAC_WAVE_DISABLE);
        dac_mode_config(dac_channels[i].periph, dac_channels[i].out, NORMAL_PIN_BUFFON);
        dac_enable(dac_channels[i].periph, dac_channels[i].out);
    }

    /* Free-running counter: enable the Cortex-M33 DWT cycle counter.
     * TRCENA in CoreDebug->DEMCR gates the entire DWT/ITM trace block;
     * setting CYCCNTENA in DWT->CTRL starts the 32-bit free-running
     * counter at the core clock rate (240 MHz on the GD32G553 in the
     * stock clock config -> ~17.9 s wrap, ~4.16 ns LSB).  The counter
     * is the source for bridge_hw_counter_read(). */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0u;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    /* PWM bring-up: configure the 8 PWM pads as alt-function outputs,
     * enable TIMER0 + TIMER7 clocks, run the per-timer + per-channel
     * init.  After this the timers are running at 1 us tick with 0%
     * duty on every channel; bridge_hw_pwm_set programs both the
     * channel compare register and the timer ARR per call. */
    for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
        const gd32_pwm_ch_t *ch = &pwm_channels[i];
        gpio_mode_set(ch->gpio_port, GPIO_MODE_AF, GPIO_PUPD_NONE, ch->gpio_pin);
        gpio_output_options_set(ch->gpio_port, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ, ch->gpio_pin);
        gpio_af_set(ch->gpio_port, ch->gpio_af, ch->gpio_pin);
    }
    rcu_periph_clock_enable(RCU_TIMER0);
    rcu_periph_clock_enable(RCU_TIMER7);
    pwm_timer_init(TIMER0);
    pwm_timer_init(TIMER7);
    for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
        pwm_channel_init(&pwm_channels[i]);
    }

    /* ADC bring-up: configure 8 pads as analog, enable all four ADC
     * peripheral clocks, run the per-peripheral init.  No calibration
     * pass here -- it needs a millisecond settling delay after
     * adc_enable() and the bridge boot has no SysTick yet.  A
     * follow-up commit can add calibration once a delay primitive
     * lands. */
    for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
        gpio_mode_set(adc_channels_map[i].gpio_port, GPIO_MODE_ANALOG, GPIO_PUPD_NONE,
                      adc_channels_map[i].gpio_pin);
    }
    rcu_periph_clock_enable(RCU_ADC0);
    rcu_periph_clock_enable(RCU_ADC1);
    rcu_periph_clock_enable(RCU_ADC2);
    rcu_periph_clock_enable(RCU_ADC3);
    adc_periph_init(ADC0);
    adc_periph_init(ADC1);
    adc_periph_init(ADC2);
    adc_periph_init(ADC3);
    for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
        adc_sample_cycles_cache[i] = ADC_DEFAULT_SAMPLE_CYCLES;
    }

    /* Quadrature encoder bring-up: TIMER1..4 host the four E1M
     * encoder pairs.  Each timer uses its CH0 + CH1 input-capture
     * units as the X / Y quadrature inputs (decoder mode 2 -> X4). */
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_TIMER2);
    rcu_periph_clock_enable(RCU_TIMER3);
    rcu_periph_clock_enable(RCU_TIMER4);
    for (size_t i = 0; i < QENC_CHANNEL_COUNT; ++i) {
        qenc_channel_init(&qenc_map[i]);
    }
}

/* Called from the SysTick handler (or the main loop's idle path)
 * on a fixed cadence.  Future real implementation will sample the
 * DA9292_INT(P37)/DA9292_TW(P36) GPIO inputs and update the fault-
 * flag byte returned by bridge_hw_da9292_status_cached().  The GD32
 * has no I2C path to the DA9292, so this never reads a PMIC register
 * -- pin state only.  Pin sampling lands in a future firmware
 * release; current firmware leaves this a no-op. */
void bridge_hw_tick(void)
{
    /* No-op today. */
}

/* ----------------------------------------------------------------- */
/* Stub bodies -- shape mirrors bridge_hw_stub.c so the gd32 backend  */
/* is binary-compatible with the stub backend pending real impls.    */
/* ----------------------------------------------------------------- */

uint8_t bridge_hw_reset_reason(void)
{
    /* Read RCU_RSTSCK (reset/clock control status register, GD32G5xx
     * Reference Manual §6.6.13) and decode the sticky reset-cause
     * flags in the high byte: PORRSTF (bit 27), BORRSTF (25),
     * EPRSTF (26, NRST pin), SWRSTF (28), FWDGTRSTF (29),
     * WWDGTRSTF (30), LPRSTF (31).
     *
     * The hardware can latch multiple flags across nested resets, so
     * we decode in coldest-first priority order: a power-on event
     * dominates a brownout, which dominates an external-pin reset,
     * which dominates a watchdog or software trigger.  Encoded byte
     * matches the host's `gd32g553_reset_cause_t` in
     * <alp/chips/gd32g553.h>:
     *
     *   0 = UNKNOWN, 1 = POWER_ON, 2 = NRST_PIN, 3 = SOFT,
     *   4 = WDT, 5 = BROWNOUT, 6 = LOWPOWER.
     *
     * RSTFC (bit 24) clears every cause flag in one write; the vendor
     * helper `rcu_all_reset_flag_clear()` is functionally identical
     * but we keep the access inline to avoid pulling rcu.c stages we
     * don't otherwise need.  After the write the next reader sees
     * UNKNOWN unless something resets the chip again. */
    const uint32_t rstsck = RCU_RSTSCK;
    uint8_t        cause  = 0u; /* UNKNOWN */

    if (rstsck & RCU_RSTSCK_PORRSTF) {
        cause = 1u; /* POWER_ON */
    } else if (rstsck & RCU_RSTSCK_BORRSTF) {
        cause = 5u; /* BROWNOUT */
    } else if (rstsck & RCU_RSTSCK_EPRSTF) {
        cause = 2u; /* NRST_PIN */
    } else if (rstsck & RCU_RSTSCK_LPRSTF) {
        cause = 6u; /* LOWPOWER */
    } else if (rstsck & (RCU_RSTSCK_FWDGTRSTF | RCU_RSTSCK_WWDGTRSTF)) {
        cause = 4u; /* WDT */
    } else if (rstsck & RCU_RSTSCK_SWRSTF) {
        cause = 3u; /* SOFT */
    }

    RCU_RSTSCK |= RCU_RSTSCK_RSTFC;
    return cause;
}

int bridge_hw_gpio_read(uint32_t mask, uint32_t *levels)
{
    if (levels == 0) return BRIDGE_HW_ERR_INVAL;
    *levels = 0u;
    /* Bits above `GPIO_PAD_MAP_COUNT` are silently ignored -- the
     * host header documents the mapping as opaque, so out-of-range
     * bits are treated as "no pad selected" rather than an error. */
    for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
        if ((mask & ((uint32_t)1u << i)) == 0u) continue;
        const FlagStatus s = gpio_is_output[i]
                                 ? gpio_output_bit_get(gpio_pad_map[i].periph, gpio_pad_map[i].pin)
                                 : gpio_input_bit_get(gpio_pad_map[i].periph, gpio_pad_map[i].pin);
        if (s == SET) {
            *levels |= ((uint32_t)1u << i);
        }
    }
    return BRIDGE_HW_OK;
}

