alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
int bridge_hw_gpio_write(uint32_t mask, uint32_t levels)
{
    /* Out-of-range bits silently ignored, same policy as
     * bridge_hw_gpio_read(). */
    for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
        if ((mask & ((uint32_t)1u << i)) == 0u) continue;
        if (!gpio_is_output[i]) {
            /* First write to this pad since boot: promote
             * INPUT+PULL_UP to OUTPUT push-pull.  12 MHz is the
             * GD32G5's slowest output speed (datasheet §7.4.1);
             * adequate for control lines, low EMI.  The bridge
             * dispatcher is single-threaded so no locking is
             * needed around the mode flip + the flag write. */
            gpio_output_options_set(gpio_pad_map[i].periph, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ,
                                    gpio_pad_map[i].pin);
            gpio_mode_set(gpio_pad_map[i].periph, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE,
                          gpio_pad_map[i].pin);
            gpio_is_output[i] = true;
        }
        if (levels & ((uint32_t)1u << i)) {
            gpio_bit_set(gpio_pad_map[i].periph, gpio_pad_map[i].pin);
        } else {
            gpio_bit_reset(gpio_pad_map[i].periph, gpio_pad_map[i].pin);
        }
    }
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_set(uint8_t channel, uint32_t period_ns, uint32_t duty_ns)
{
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    if (duty_ns > period_ns) return BRIDGE_HW_ERR_INVAL;

    /* Clear OPM if a prior bridge_hw_pwm_single_pulse left the timer
     * in one-pulse mode -- per the contract, a subsequent PWM_SET
     * returns the channel (and any other channels on the same timer)
     * to continuous output. */
    timer_single_pulse_mode_config(pwm_channels[channel].periph, TIMER_SP_MODE_REPETITIVE);

    /* Round period + duty to whole microseconds (the timer tick).
     * `period_us` must fit in 16 bits (ARR) -- caller is responsible
     * for staying under ~65 ms; we clamp on over-range so the timer
     * doesn't get an invalid value. */
    uint32_t period_us = period_ns / PWM_TIMER_TICK_NS;
    uint32_t duty_us   = duty_ns / PWM_TIMER_TICK_NS;
    if (period_us == 0u) return BRIDGE_HW_ERR_RANGE;
    if (period_us > PWM_TIMER_ARR_MAX + 1u) period_us = PWM_TIMER_ARR_MAX + 1u;
    if (duty_us > period_us) duty_us = period_us;

    const gd32_pwm_ch_t *ch = &pwm_channels[channel];

    /* ARR is "period_us - 1" because the up-counter counts 0..ARR
     * inclusive (period_us ticks total).  Updates ALL channels of
     * the same timer -- the contract documents this constraint. */
    timer_autoreload_value_config(ch->periph, (uint32_t)(period_us - 1u));
    timer_channel_output_pulse_value_config(ch->periph, ch->channel, duty_us);

    /* Cache the host's request for read-back.  The HW reality is
     * shared-period; the cache keeps per-channel intent. */
    pwm_period_ns_cache[channel] = period_ns;
    pwm_duty_ns_cache[channel]   = duty_ns;
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_get(uint8_t channel, uint32_t *period_ns, uint32_t *duty_ns)
{
    if (period_ns == 0 || duty_ns == 0) return BRIDGE_HW_ERR_INVAL;
    *period_ns = 0u;
    *duty_ns   = 0u;
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    *period_ns = pwm_period_ns_cache[channel];
    *duty_ns   = pwm_duty_ns_cache[channel];
    return BRIDGE_HW_OK;
}

int bridge_hw_adc_read(uint8_t channel, uint8_t samples, uint16_t *mv)
{
    if (mv == 0) return BRIDGE_HW_ERR_INVAL;
    if (samples == 0u) return BRIDGE_HW_ERR_INVAL;
    if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;

    const gd32_adc_ch_t *ch = &adc_channels_map[channel];

    /* Configure the routine channel for this op (each call re-applies
     * because multiple bridge channels can share an ADC peripheral -- a
     * prior bridge_hw_adc_read on a different bridge channel may have
     * pointed the routine slot elsewhere).  Sample-cycle count comes
     * from the per-channel cache so bridge_hw_adc_configure's choice
     * survives across reads. */
    adc_routine_channel_config(ch->periph, 0u, ch->channel, adc_sample_cycles_cache[channel]);

    /* Take `samples` consecutive conversions, software-triggered per
     * sample.  Polled EOC.  No timeout -- if the ADC is wedged the
     * SysTick watchdog (when it ships) catches it; in the steady-state
     * a 12-bit conversion at HCLK/6 finishes in ~6 us so the spin is
     * brief. */
    for (uint8_t i = 0; i < samples; ++i) {
        adc_software_trigger_enable(ch->periph, ADC_ROUTINE_CHANNEL);
        while (!adc_flag_get(ch->periph, ADC_FLAG_EOC)) {
            /* spin */
        }
        adc_flag_clear(ch->periph, ADC_FLAG_EOC);
        uint32_t code = adc_routine_data_read(ch->periph);
        if (code > ADC_FULL_SCALE) code = ADC_FULL_SCALE;
        mv[i] = (uint16_t)((code * ADC_VREF_MV) / ADC_FULL_SCALE);
    }
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_configure(uint8_t channel, uint8_t align_mode, uint32_t dead_time_ns,
                            uint8_t break_cfg)
{
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

    /* v0.3 partial: accept the default settings that bridge_hw_init's
     * pwm_timer_init() programs (edge-aligned counter, no dead-time,
     * no break input) so the host's idempotent "set to defaults"
     * config calls succeed.  Non-defaults need timer-wide reconfigs
     * (CAM field via re-init, timer_break_config struct) that share
     * across all channels on the same timer; defer to a follow-up
     * with a per-timer apply path + last-write-wins semantics. */
    if (align_mode != 0u) return BRIDGE_HW_ERR_NOTIMPL;
    if (dead_time_ns != 0u) return BRIDGE_HW_ERR_NOTIMPL;
    if (break_cfg != 0u) return BRIDGE_HW_ERR_NOTIMPL;
    return BRIDGE_HW_OK;
}

int bridge_hw_adc_configure(uint8_t channel, uint16_t oversample_ratio, uint16_t sample_cycles,
                            uint8_t resolution_bits)
{
    if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;

    /* v0.3 partial: only sample_cycles is sticky.  The oversample +
     * resolution paths are still gated to their defaults (1, 12).
     * Non-default values return NOSUPPORT so the host gets a clear
     * "this commit doesn't support that yet" rather than silently
     * accepting and ignoring.  A follow-up commit will land the
     * resolution + oversample apply path. */
    if (oversample_ratio != 1u) return BRIDGE_HW_ERR_NOTIMPL;
    if (resolution_bits != 12u) return BRIDGE_HW_ERR_NOTIMPL;

    /* Sample cycles: clamp to the vendor's accepted 2..638 cycle
     * range (per `adc_routine_channel_config`'s sample_time
     * parameter).  Round caller-supplied values into this range
     * rather than rejecting -- matches the contract's "firmware
     * rounds down" wording. */
    uint16_t sc = sample_cycles;
    if (sc < 2u) sc = 2u;
    if (sc > 638u) sc = 638u;

    adc_sample_cycles_cache[channel] = sc;
    return BRIDGE_HW_OK;
}

/* Stream-DMA bring-up state.  Two parallel streams: stream 0 binds
 * DMA0_CH0, stream 1 binds DMA1_CH0.  Each stream owns a circular
 * ring buffer that the DMA fills peripheral-to-memory at the ADC
 * clock; bridge_hw_adc_stream_read drains samples between the host's
 * polls.
 *
 * Ring size is chosen so a 100 kHz stream fills it in ~10 ms (1024
 * samples) -- comfortably above the host's typical poll cadence yet
 * small enough to keep the SRAM footprint inside the GD32G553's
 * 128 KB budget.  Total cost: 2 streams x 1024 samples x 2 bytes =
 * 4 KB. */
#define BRIDGE_ADC_STREAM_RING_SAMPLES 1024u
#define BRIDGE_ADC_STREAM_COUNT 2u

