alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
typedef struct {
    bool          in_use;
    uint8_t       channel;     /* ADC channel index this stream watches */
    uint32_t      dma_periph;  /* DMA0 or DMA1                          */
    uint8_t       dma_channel; /* dma_channel_enum value                */
    uint16_t      ring[BRIDGE_ADC_STREAM_RING_SAMPLES];
    uint16_t      read_idx;    /* host's consumer cursor                */
    uint8_t       dsp_chain_id;
    bool          dsp_bound;
} adc_stream_state_t;

static adc_stream_state_t adc_streams[BRIDGE_ADC_STREAM_COUNT];

/* DMA write-cursor read.  The DMA channel counter counts DOWN from
 * the configured transfer length; converting to a write index uses
 * `ring_samples - remaining`.  Wraps naturally via the circular-mode
 * reload. */
static uint16_t adc_stream_write_index(const adc_stream_state_t *s)
{
    const uint32_t remaining = dma_transfer_number_get(s->dma_periph,
                                                       (dma_channel_enum)s->dma_channel);
    if (remaining > BRIDGE_ADC_STREAM_RING_SAMPLES) return 0u;
    return (uint16_t)(BRIDGE_ADC_STREAM_RING_SAMPLES - remaining);
}

int bridge_hw_adc_stream_begin(uint8_t stream_id, uint8_t channel, uint32_t sample_rate_hz)
{
    if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
    if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;
    if (sample_rate_hz == 0u) return BRIDGE_HW_ERR_INVAL;

    adc_stream_state_t *s = &adc_streams[stream_id];
    if (s->in_use) return BRIDGE_HW_ERR_INVAL; /* stream already running */

    const gd32_adc_ch_t *ch = &adc_channels_map[channel];

    /* Stream 0 -> DMA0, stream 1 -> DMA1.  Channel 0 of each DMA
     * controller is the first free slot in the GD32G5x3 dma_channel
     * enum; bridge brings up no other DMA users today so collisions
     * are not a concern. */
    s->dma_periph  = (stream_id == 0u) ? DMA0 : DMA1;
    s->dma_channel = (uint8_t)DMA_CH0;

    rcu_periph_clock_enable((stream_id == 0u) ? RCU_DMA0 : RCU_DMA1);
    dma_deinit(s->dma_periph, (dma_channel_enum)s->dma_channel);

    dma_parameter_struct init;
    init.periph_addr  = (uint32_t)(uintptr_t)&ADC_RDATA(ch->periph);
    init.memory_addr  = (uint32_t)(uintptr_t)s->ring;
    init.direction    = DMA_PERIPHERAL_TO_MEMORY;
    init.number       = BRIDGE_ADC_STREAM_RING_SAMPLES;
    init.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    init.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    init.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    init.memory_width = DMA_MEMORY_WIDTH_16BIT;
    init.priority     = DMA_PRIORITY_MEDIUM;
    /* DMAMUX request: route the channel to this ADC instance.  Without
     * this the request id is left uninitialised and the channel triggers
     * on the wrong (or no) source. */
    init.request      = (ch->periph == ADC1) ? DMA_REQUEST_ADC1 :
                        (ch->periph == ADC2) ? DMA_REQUEST_ADC2 :
                        (ch->periph == ADC3) ? DMA_REQUEST_ADC3 : DMA_REQUEST_ADC0;
    dma_init(s->dma_periph, (dma_channel_enum)s->dma_channel, &init);

    /* Circular mode -- DMA reloads `number` after each cycle so the
     * channel keeps running without firmware re-arms.  Combined with
     * adc_dma_mode_enable below this produces a steady-state
     * peripheral-to-ring pipeline with no firmware in the hot path. */
    dma_circulation_enable(s->dma_periph, (dma_channel_enum)s->dma_channel);

    /* Set up the ADC routine slot for this channel + tell the ADC to
     * issue a DMA request on every conversion completion.  Continuous
     * mode means the ADC self-triggers after each conversion; the
     * resulting sample rate is HCLK / 6 / sample_cycles -- the
     * `sample_rate_hz` argument is currently an aspirational hint that
     * a future commit will translate to a sample-cycle override. */
    (void)sample_rate_hz; /* aspirational; see comment above */
    adc_routine_channel_config(ch->periph, 0u, ch->channel,
                               adc_sample_cycles_cache[channel]);
    adc_special_function_config(ch->periph, ADC_CONTINUOUS_MODE, ENABLE);
    adc_dma_mode_enable(ch->periph);

    dma_channel_enable(s->dma_periph, (dma_channel_enum)s->dma_channel);

    /* Software-trigger the first conversion.  In continuous mode the
     * ADC will re-trigger itself after this. */
    adc_software_trigger_enable(ch->periph, ADC_ROUTINE_CHANNEL);

    s->in_use       = true;
    s->channel      = channel;
    s->read_idx     = 0u;
    s->dsp_chain_id = 0u;
    s->dsp_bound    = false;
    return BRIDGE_HW_OK;
}

int bridge_hw_adc_stream_read(uint8_t stream_id, uint8_t max_samples, uint8_t *got_samples,
                              uint16_t *mv)
{
    if (got_samples == 0) return BRIDGE_HW_ERR_INVAL;
    *got_samples = 0u;
    if (mv == 0) return BRIDGE_HW_ERR_INVAL;
    if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;

    adc_stream_state_t *s = &adc_streams[stream_id];
    if (!s->in_use) return BRIDGE_HW_ERR_INVAL;

    /* Drain as many fresh samples as the host asked for, capped by
     * what the DMA has actually deposited since the last read.  The
     * DMA cursor walks forward through the ring; producer/consumer
     * indices wrap independently, and a write cursor that has lapped
     * the reader is detected via the unsigned-arithmetic delta. */
    const uint16_t w = adc_stream_write_index(s);
    uint16_t       avail;
    if (w >= s->read_idx) {
        avail = (uint16_t)(w - s->read_idx);
    } else {
        avail = (uint16_t)((BRIDGE_ADC_STREAM_RING_SAMPLES - s->read_idx) + w);
    }
    if (avail == 0u) return BRIDGE_HW_OK; /* empty ring; host should poll later */

    uint16_t to_emit = (avail < max_samples) ? avail : max_samples;
    for (uint16_t i = 0u; i < to_emit; ++i) {
        uint32_t code = s->ring[s->read_idx];
        if (code > ADC_FULL_SCALE) code = ADC_FULL_SCALE;
        mv[i] = (uint16_t)((code * ADC_VREF_MV) / ADC_FULL_SCALE);
        s->read_idx = (uint16_t)((s->read_idx + 1u) % BRIDGE_ADC_STREAM_RING_SAMPLES);
    }
    *got_samples = (uint8_t)to_emit;
    return BRIDGE_HW_OK;
}

int bridge_hw_adc_stream_end(uint8_t stream_id)
{
    if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
    adc_stream_state_t *s = &adc_streams[stream_id];
    if (!s->in_use) return BRIDGE_HW_OK; /* idempotent */

