alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
    /* Stop the ADC's self-trigger first, then disarm the DMA -- the
     * other order can leave one in-flight transfer landing after the
     * channel is disabled. */
    const gd32_adc_ch_t *ch = &adc_channels_map[s->channel];
    adc_special_function_config(ch->periph, ADC_CONTINUOUS_MODE, DISABLE);
    adc_dma_mode_disable(ch->periph);
    dma_channel_disable(s->dma_periph, (dma_channel_enum)s->dma_channel);

    s->in_use    = false;
    s->dsp_bound = false;
    return BRIDGE_HW_OK;
}

int bridge_hw_trng_read(uint8_t *dest, size_t len)
{
    if (dest == 0) return BRIDGE_HW_ERR_INVAL;
    if (len == 0u || len > 32u) return BRIDGE_HW_ERR_RANGE;
    if (!trng_ready) return BRIDGE_HW_ERR_IO;

    /* Pull 32-bit randoms and pack their LSB bytes into `dest`.  A
     * single trng_get_true_random_data() call drains one entry from
     * the TRNG's output FIFO and the unit refills autonomously; we
     * poll DRDY between pulls so a starved-noise condition doesn't
     * silently emit a stale word. */
    size_t off = 0u;
    while (off < len) {
        uint32_t to;
        for (to = TRNG_READY_TIMEOUT; to != 0u; --to) {
            if (SET == trng_flag_get(TRNG_FLAG_DRDY)) break;
        }
        if (to == 0u) return BRIDGE_HW_ERR_IO;
        if (SET == trng_flag_get(TRNG_FLAG_CECS)) return BRIDGE_HW_ERR_IO;
        if (SET == trng_flag_get(TRNG_FLAG_SECS)) return BRIDGE_HW_ERR_IO;

        uint32_t     word  = trng_get_true_random_data();
        const size_t chunk = (len - off >= 4u) ? 4u : (len - off);
        for (size_t i = 0; i < chunk; ++i) {
            dest[off++] = (uint8_t)(word & 0xFFu);
            word >>= 8;
        }
    }
    return BRIDGE_HW_OK;
}

int bridge_hw_tmu_compute(uint8_t function, uint8_t format, uint32_t in_a, uint32_t in_b,
                          uint32_t *result_out)
{
    if (result_out == 0) return BRIDGE_HW_ERR_INVAL;
    *result_out = 0u;
    if (function >= TMU_DISPATCH_COUNT) return BRIDGE_HW_ERR_INVAL;
    if (format > 1u) return BRIDGE_HW_ERR_INVAL;

    const tmu_dispatch_t *d = &tmu_dispatch[function];
    if (d->inputs == 0u) {
        /* tan / exp / tanh: GD32G5 TMU has no native mode.  Host
         * wrapper sees STATUS_NOSUPPORT and (eventually) falls back
         * to libm or composes via two TMU calls. */
        return BRIDGE_HW_ERR_NOTIMPL;
    }

    /* Configure TMU for this op.  Per-call config keeps the dispatch
     * stateless -- a previous SIN call doesn't leave the TMU in a
     * state that surprises a subsequent SQRT call. */
    tmu_parameter_struct cfg;
    tmu_struct_para_init(&cfg);
    tmu_deinit();
    cfg.mode            = d->mode;
    cfg.scale           = TMU_SCALING_FACTOR_1;
    cfg.dma_read        = TMU_READ_DMA_DISABLE;
    cfg.dma_write       = TMU_WRITE_DMA_DISABLE;
    cfg.input_width     = TMU_INPUT_WIDTH_32;
    cfg.output_width    = TMU_OUTPUT_WIDTH_32;
    cfg.input_floating  = (format == 1u) ? TMU_INPUT_FLOAT_ENABLE : TMU_INPUT_FLOAT_DISABLE;
    cfg.output_floating = (format == 1u) ? TMU_OUTPUT_FLOAT_ENABLE : TMU_OUTPUT_FLOAT_DISABLE;
    cfg.write_times     = (d->inputs == 2u) ? TMU_WRITE_TIMES_2 : TMU_WRITE_TIMES_1;
    /* SIN/COS emit two output words (the scaled result + an auxiliary
     * scaling factor); every other mode emits one.  We always return
     * the first word; reads are sized accordingly so the TMU END flag
     * clears cleanly. */
    const bool sin_or_cos = (d->mode == TMU_MODE_SIN) || (d->mode == TMU_MODE_COS);
    cfg.read_times        = sin_or_cos ? TMU_READ_TIMES_2 : TMU_READ_TIMES_1;
    tmu_init(&cfg);

    /* Issue the op.  For SIN/COS the host's `in_b` is unused (host
     * wrapper passes 0); the TMU's `m*sin(theta)` form needs a
     * non-zero modulus, so substitute unit-scale (1.0 in the active
     * format).  For native 2-input modes (ATAN2, MODULUS) the host's
     * in_b is the actual second operand. */
    uint32_t b = in_b;
    if (sin_or_cos) {
        b = (format == 1u) ? f32_to_bits(1.0f) /* IEEE-754 */
                           : 0x7FFFFFFFu;      /* Q31 ~1.0  */
    }
    if (d->inputs == 2u) {
        if (format == 1u) {
            tmu_two_f32_write(bits_to_f32(in_a), bits_to_f32(b));
        } else {
            tmu_two_q31_write(in_a, b);
        }
    } else {
        if (format == 1u) {
            tmu_one_f32_write(bits_to_f32(in_a));
        } else {
            tmu_one_q31_write(in_a);
        }
    }

    /* Wait for END.  Bounded so a misconfigured op doesn't hang. */
    uint32_t to = TMU_COMPUTE_TIMEOUT;
    while ((RESET == tmu_flag_get(TMU_FLAG_END)) && --to) {
        /* spin */
    }
    if (to == 0u) return BRIDGE_HW_ERR_IO;
    if (SET == tmu_flag_get(TMU_FLAG_OVRF)) {
        tmu_flag_clear(TMU_FLAG_OVRF);
        return BRIDGE_HW_ERR_RANGE;
    }

    /* Drain output(s).  For SIN/COS the second word is the aux
     * scaling factor; we discard it.  Single-output modes need
     * only one read. */
    if (sin_or_cos) {
        if (format == 1u) {
            float fr;
            float faux;
            tmu_two_f32_read(&fr, &faux);
            *result_out = f32_to_bits(fr);
        } else {
            uint32_t aux;
            tmu_two_q31_read(result_out, &aux);
        }
    } else {
        if (format == 1u) {
            float fr;
            tmu_one_f32_read(&fr);
            *result_out = f32_to_bits(fr);
        } else {
            tmu_one_q31_read(result_out);
        }
    }
    return BRIDGE_HW_OK;
}

int bridge_hw_dac_set(uint8_t channel, uint16_t value_mv)
{
    if (channel >= DAC_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    /* mV -> 12-bit code, clamp on over-range (the host doesn't see
     * BRIDGE_HW_ERR_RANGE for this case -- saturating is friendlier
     * than rejecting a request the user can recover from by reading
     * back the actual programmed value). */
    uint32_t code = ((uint32_t)value_mv * DAC_FULL_SCALE) / DAC_VREF_MV;
    if (code > DAC_FULL_SCALE) code = DAC_FULL_SCALE;
    dac_data_set(dac_channels[channel].periph, dac_channels[channel].out, DAC_ALIGN_12B_R,
                 (uint16_t)code);
    return BRIDGE_HW_OK;
}

