alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
int bridge_hw_dac_get(uint8_t channel, uint16_t *value_mv)
{
    if (value_mv == 0) return BRIDGE_HW_ERR_INVAL;
    *value_mv = 0u;
    if (channel >= DAC_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    /* dac_output_value_get reads the DAC's hold register (the value
     * currently driving the pad), not the input setpoint -- this is
     * what we want for read-back: callers see the actual code in
     * play, which may differ from the last `set` if the DAC was
     * concurrent-paired or DMA-driven elsewhere. */
    uint16_t code = dac_output_value_get(dac_channels[channel].periph, dac_channels[channel].out);
    if (code > DAC_FULL_SCALE) code = DAC_FULL_SCALE;
    *value_mv = (uint16_t)(((uint32_t)code * DAC_VREF_MV) / DAC_FULL_SCALE);
    return BRIDGE_HW_OK;
}

int bridge_hw_qenc_read(uint8_t encoder, int32_t *position)
{
    if (position == 0) return BRIDGE_HW_ERR_INVAL;
    *position = 0;
    if (encoder >= QENC_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    /* Cast the raw counter (uint32_t) to int32_t.  For 16-bit timers
     * (TIMER2, TIMER3) the upper bits read zero so the value is
     * always positive; for 32-bit timers (TIMER1, TIMER4) the value
     * wraps the full int32_t range.  The host detects wraps via
     * deltas. */
    *position = (int32_t)timer_counter_read(qenc_map[encoder].timer_periph);
    return BRIDGE_HW_OK;
}

int bridge_hw_qenc_reset(uint8_t encoder)
{
    if (encoder >= QENC_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    timer_counter_value_config(qenc_map[encoder].timer_periph, 0u);
    return BRIDGE_HW_OK;
}

int bridge_hw_counter_read(uint8_t counter, uint32_t *ticks)
{
    if (ticks == 0) return BRIDGE_HW_ERR_INVAL;
    *ticks = 0u;
    /* Single free-running counter exposed today; future revisions can
     * carve out additional ids for derived (slower) tick bases.  The
     * DWT counter ticks at the core clock (240 MHz on GD32G553),
     * wraps every ~17.9 s, and is monotonically non-decreasing across
     * reads -- the host can compute deltas without watching for
     * mid-read consistency since the register is atomic. */
    if (counter != 0u) return BRIDGE_HW_ERR_RANGE;
    *ticks = DWT->CYCCNT;
    return BRIDGE_HW_OK;
}

uint8_t bridge_hw_da9292_status_cached(void)
{
    return 0xFFu; /* "no DA9292 pin sample taken yet" sentinel */
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B.2) -- advanced timer extras                             */
/* ----------------------------------------------------------------- */

/* Per-channel input-capture state.  Polled model -- the bridge
 * dispatcher runs single-threaded between transport ISRs so the
 * host's bridge_hw_pwm_capture_read poll-loop naturally drains the
 * capture register.  Each entry caches the most-recent (period,
 * pulse-width) pair latched from the timer's CCxVAL register.
 *
 * V2N-specific caveat: the PWM map binds the COMPLEMENTARY output
 * pad (CHxN) of each advanced-timer channel.  The TIx input-capture
 * path reads the MAIN CHx pad, which is a physically different pin
 * on the GD32G5x3.  BEGIN below switches the channel from output
 * mode to input-capture mode -- the CHCTL field is rewritten so the
 * complementary output stops driving -- but the capture pad routing
 * has to be reworked by the maintainer in a hardware-bring-up commit
 * before READ delivers real edges.  Until then the firmware
 * structure (config + polled drain + correct unit conversion) is
 * exercised end-to-end and READ surfaces BRIDGE_HW_ERR_NOTIMPL
 * ("ring empty") as documented. */
typedef struct {
    uint32_t last_tick;         /* most-recent CCxVAL                  */
    uint32_t period_ticks;      /* drained delta -- same-edge to same  */
    uint32_t pulse_width_ticks; /* rising-to-falling delta             */
    uint8_t  edge;              /* 0 rising / 1 falling / 2 both       */
    uint8_t  state;             /* 0 waiting first / 1 have-rising /
                                   2 have-falling                       */
    bool     in_capture;        /* true between BEGIN..END             */
    bool     have_period;       /* a period sample is ready to drain   */
    bool     have_pulse;        /* a pulse-width sample is ready       */
} pwm_capture_state_t;

static pwm_capture_state_t pwm_capture[PWM_CHANNEL_COUNT];

/* CCxIF flag for a channel index 0..3.  Mirrors timer.h's flag macros
 * but exposed here so the polled drain can pick the right one without
 * a switch. */
static uint32_t pwm_capture_flag(uint16_t ch)
{
    switch (ch) {
    case TIMER_CH_0:
        return TIMER_FLAG_CH0;
    case TIMER_CH_1:
        return TIMER_FLAG_CH1;
    case TIMER_CH_2:
        return TIMER_FLAG_CH2;
    case TIMER_CH_3:
        return TIMER_FLAG_CH3;
    default:
        return 0u;
    }
}

/* Drain any newly-latched capture from the timer's CCxVAL into the
 * per-channel state.  Polled from bridge_hw_pwm_capture_read; safe to
 * call when no edge has occurred (clears nothing, leaves state). */
static void pwm_capture_drain(uint8_t channel)
{
    pwm_capture_state_t *s    = &pwm_capture[channel];
    const gd32_pwm_ch_t *ch   = &pwm_channels[channel];
    const uint32_t       flag = pwm_capture_flag(ch->channel);
    if (flag == 0u) return;
    if (RESET == timer_flag_get(ch->periph, flag)) return;

    const uint32_t now = timer_channel_capture_value_register_read(ch->periph, ch->channel);
    timer_flag_clear(ch->periph, flag);

    if (s->edge == 2u) {
        /* Both-edge polarity.  Alternate the state machine: the
         * first edge after BEGIN seeds last_tick; the second is a
         * rising-to-falling delta (pulse_width); the third closes
         * the period.  After the third edge the cycle repeats. */
        switch (s->state) {
        case 0u: /* first edge -- seed */
            s->last_tick = now;
            s->state     = 1u;
            break;
        case 1u: /* second edge -- pulse_width sample */
            s->pulse_width_ticks = now - s->last_tick;
            s->have_pulse        = true;
            s->last_tick         = now;
            s->state             = 2u;
            break;
        case 2u: /* third edge -- period closer */
        default:
            s->period_ticks = (now - s->last_tick) + s->pulse_width_ticks;
            s->have_period  = true;
            s->last_tick    = now;
            s->state        = 1u;
            break;
        }
    } else {
        /* Single-edge polarity (rising OR falling).  Delta between
         * consecutive same-edge captures is the period; pulse_width
         * is not observable in this mode -- left at zero. */
        if (s->state == 0u) {
            s->last_tick = now;
            s->state     = 1u;
        } else {
            s->period_ticks = now - s->last_tick;
            s->have_period  = true;
            s->last_tick    = now;
        }
    }
}

int bridge_hw_pwm_capture_begin(uint8_t channel, uint8_t edge)
{
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
    if (edge > 2u) return BRIDGE_HW_ERR_INVAL;

    const gd32_pwm_ch_t *ch = &pwm_channels[channel];

    /* Tear down any output state on this channel.  Disabling the
     * complementary output before switching the channel direction
     * stops the pad driving immediately; bridge_hw_pwm_set will
     * fully re-init both directions on a subsequent call. */
    timer_channel_output_state_config(ch->periph, ch->channel, TIMER_CCX_DISABLE);
    timer_channel_complementary_output_state_config(ch->periph, ch->channel, TIMER_CCXN_DISABLE);

    /* Switch the pad's GPIO mode to AF input (pull-up keeps a
     * disconnected line at a defined level).  The pad still uses the
     * timer's AF -- on the GD32G5 the same AF carries both directions
     * for a given (port, pin) so we don't touch gpio_af_set. */
    gpio_mode_set(ch->gpio_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, ch->gpio_pin);

    /* Configure the input-capture parameters.  Filter=0 (no debounce
     * cycles) -- the host can ask for a fixed filter via a follow-up
     * opcode if a glitchy source needs it.  Prescaler=DIV1 captures
     * every selected edge. */
    timer_ic_parameter_struct ic;
    timer_channel_input_struct_para_init(&ic);
    ic.icpolarity  = (edge == 0u) ? TIMER_IC_POLARITY_RISING
                     : (edge == 1u) ? TIMER_IC_POLARITY_FALLING
                                    : TIMER_IC_POLARITY_BOTH_EDGE;
    ic.icselection = TIMER_IC_SELECTION_DIRECTTI;
    ic.icprescaler = TIMER_IC_PSC_DIV1;
    ic.icfilter    = 0u;
    timer_input_capture_config(ch->periph, ch->channel, &ic);

