alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
    /* Clear any stale capture flag so the first drained edge after
     * BEGIN is genuinely the first new edge. */
    timer_flag_clear(ch->periph, pwm_capture_flag(ch->channel));

    pwm_capture[channel].last_tick         = 0u;
    pwm_capture[channel].period_ticks      = 0u;
    pwm_capture[channel].pulse_width_ticks = 0u;
    pwm_capture[channel].edge              = edge;
    pwm_capture[channel].state             = 0u;
    pwm_capture[channel].in_capture        = true;
    pwm_capture[channel].have_period       = false;
    pwm_capture[channel].have_pulse        = false;
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_capture_read(uint8_t channel, uint32_t *period_ns, uint32_t *pulse_width_ns)
{
    if (period_ns == 0 || pulse_width_ns == 0) return BRIDGE_HW_ERR_INVAL;
    *period_ns      = 0u;
    *pulse_width_ns = 0u;
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

    pwm_capture_state_t *s = &pwm_capture[channel];
    if (!s->in_capture) return BRIDGE_HW_ERR_INVAL;

    /* Sample the timer's CCxVAL if a new edge has landed since the
     * last poll.  The drain updates `have_period` / `have_pulse`
     * when enough edges have arrived to compose a full tuple. */
    pwm_capture_drain(channel);
    if (!s->have_period) return BRIDGE_HW_ERR_NOTIMPL; /* ring empty */

    /* Convert ticks back to nanoseconds.  The PWM timers run at the
     * 1 us tick configured by pwm_timer_init (prescaler 240-1 against
     * the 240 MHz timer clock); the bridge_hw.h doc-comment's
     * "~4.16 ns LSB" refers to the unscaled core clock used by the
     * counter peripheral, not the prescaled PWM tick used here. */
    *period_ns      = s->period_ticks * PWM_TIMER_TICK_NS;
    *pulse_width_ns = s->pulse_width_ticks * PWM_TIMER_TICK_NS;

    /* Mark the period drained.  pulse_width is consumed alongside
     * because a subsequent READ should not surface stale data; the
     * next pair of edges populates both fresh. */
    s->have_period = false;
    s->have_pulse  = false;
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_capture_end(uint8_t channel)
{
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

    const gd32_pwm_ch_t *ch = &pwm_channels[channel];
    /* Disable the input-capture channel.  The contract is "return the
     * pin to high-impedance"; leaving the pad in INPUT + PULL_UP from
     * BEGIN is the closest HW approximation -- a subsequent
     * bridge_hw_pwm_set re-configures it as alt-function output
     * push-pull if the host wants to drive again. */
    timer_channel_output_state_config(ch->periph, ch->channel, TIMER_CCX_DISABLE);
    timer_flag_clear(ch->periph, pwm_capture_flag(ch->channel));

    pwm_capture[channel].in_capture = false;
    return BRIDGE_HW_OK;
}

int bridge_hw_pwm_single_pulse(uint8_t channel, uint32_t pulse_ns)
{
    if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

    uint32_t pulse_us = pulse_ns / PWM_TIMER_TICK_NS;
    if (pulse_us == 0u) return BRIDGE_HW_ERR_RANGE;
    if (pulse_us > PWM_TIMER_ARR_MAX + 1u) pulse_us = PWM_TIMER_ARR_MAX + 1u;

    const gd32_pwm_ch_t *ch = &pwm_channels[channel];

    /* Reset the timer counter so the pulse starts from t=0 then
     * program ARR = pulse_us (counts up; the channel output stays
     * high until the counter reaches the compare value).  Setting
     * compare = ARR + 1 keeps the output high through the entire
     * period so the pulse width matches `pulse_us`.  After ARR the
     * SP=SINGLE bit halts the timer until the next bridge_hw_pwm_set
     * or another bridge_hw_pwm_single_pulse re-arms it. */
    timer_counter_value_config(ch->periph, 0u);
    timer_autoreload_value_config(ch->periph, (uint32_t)(pulse_us - 1u));
    timer_channel_output_pulse_value_config(ch->periph, ch->channel, pulse_us);
    timer_single_pulse_mode_config(ch->periph, TIMER_SP_MODE_SINGLE);
    timer_enable(ch->periph);

    /* Update the cache so a follow-up bridge_hw_pwm_get reports the
     * one-pulse setpoint accurately.  Duty == period for a one-shot. */
    pwm_period_ns_cache[channel] = pulse_us * PWM_TIMER_TICK_NS;
    pwm_duty_ns_cache[channel]   = pulse_us * PWM_TIMER_TICK_NS;
    return BRIDGE_HW_OK;
}

/* Master/slave id (host-side enum) -> GD32 peripheral base address.
 * The protocol-level contract numbers the three advanced timers
 * compactly as 0 = TIMER0, 1 = TIMER7, 2 = TIMER19; this keeps the
 * wire byte small without naming the underlying SoC peripheral. */
static uint32_t timer_sync_periph(uint8_t id)
{
    switch (id) {
    case 0u:
        return TIMER0;
    case 1u:
        return TIMER7;
    case 2u:
        return TIMER19;
    default:
        return 0u;
    }
}

int bridge_hw_timer_sync(uint8_t master, uint8_t slave, uint8_t mode)
{
    if (master == slave) return BRIDGE_HW_ERR_INVAL;
    const uint32_t mp = timer_sync_periph(master);
    const uint32_t sp = timer_sync_periph(slave);
    if (mp == 0u || sp == 0u) return BRIDGE_HW_ERR_RANGE;

    /* Translate the wire `mode` byte (host-defined: 0 disabled,
     * 1 reset, 2 gated, 3 trigger, 4 external-clock, 5 encoder-mode-1)
     * to the vendor's SMC encoding (defined in gd32g5x3_syscfg.h:
     * TIMER_SLAVE_MODE_* + TIMER_QUAD_DECODER_MODE*).  The two
     * encodings differ in numeric value, so an explicit table is
     * needed here; anything outside the documented range returns
     * INVAL rather than silently selecting a default. */
    uint32_t slave_mode;
    switch (mode) {
    case 0u:
        slave_mode = TIMER_SLAVE_MODE_DISABLE;
        break;
    case 1u:
        slave_mode = TIMER_SLAVE_MODE_RESTART;
        break;
    case 2u:
        slave_mode = TIMER_SLAVE_MODE_PAUSE;
        break;
    case 3u:
        slave_mode = TIMER_SLAVE_MODE_EVENT;
        break;
    case 4u:
        slave_mode = TIMER_SLAVE_MODE_EXTERNAL0;
        break;
    case 5u:
        slave_mode = TIMER_QUAD_DECODER_MODE1;
        break;
    default:
        return BRIDGE_HW_ERR_INVAL;
    }

    /* Master side: emit the update event as TRGO0 (the canonical
     * "I just rolled over" pulse that synchronises a downstream
     * slave to the master's period) + flip the master-slave mode
     * bit so the master broadcasts its trigger.  Idempotent. */
    timer_master_output0_trigger_source_select(mp, TIMER_TRI_OUT0_SRC_UPDATE);
    timer_master_slave_mode_config(mp, TIMER_MASTER_SLAVE_MODE_ENABLE);

    /* Slave side: listen to internal trigger 0 (ITI0).  The
     * SYSCFG_TIMERCFG router maps the slave's ITI0 to a physical
     * upstream TIMER's TRGO; the chip-default routing is the
     * reference-manual table for the slave-master pair selected
     * here, and bring-up tests will tune SYSCFG if a non-default
     * routing is needed for a given (master, slave) combination.
     * Following the vendor pattern, configure the slave-mode AFTER
     * the input-trigger selection so the slave doesn't act on a
     * stale TRGI source. */
    timer_input_trigger_source_select(sp, TIMER_SMCFG_TRGSEL_ITI0);
    timer_slave_mode_select(sp, slave_mode);
    return BRIDGE_HW_OK;
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B.3) -- system power-mode set                             */
/* ----------------------------------------------------------------- */

/* ALP_POWER_WAKE_* bits the firmware supports (mirrors the wire
 * encoding in <alp/power.h>).
 *
 * Mapping notes per V2N hardware reality:
 *
 *   - GPIO : routes through PMU_WAKEUP_PIN0..4 -- five fixed pads
 *            on the GD32G553 + board wires the desired triggers
 *            onto them.  Landed §C.15c.
 *   - RTC  : RTC alarm 0 fires on a scheduled wallclock; the
 *            wakeup timer also surfaces under this bit so the
 *            firmware uses the timer (simpler than absolute-time
 *            alarms in a partial bring-up).  Landed §C.25.
 *   - TIMER: any non-zero `wake_after_ms` -- same RTC wakeup-timer
 *            path as RTC.  The bit is redundant when wake_after_ms
 *            > 0 (the timer wakes the chip implicitly per the
 *            <alp/power.h> contract); honouring the bit explicitly
 *            lets a caller arm a "wake on next tick" without a
 *            specific deadline.  Landed §C.25.
 *   - UART_RX / USB / ETH_LINK : no hardware path on the GD32G5
 *            (no LPUART wake / no USB OTG / no MAC).  Future SoCs
 *            on the bridge slot could populate these via the same
 *            opcode; today the firmware rejects them so the host
 *            knows the request is moot.
 */
#define POWER_WAKE_RTC      0x00000001u
#define POWER_WAKE_GPIO     0x00000002u
#define POWER_WAKE_UART_RX  0x00000004u
#define POWER_WAKE_TIMER    0x00000008u
#define POWER_WAKE_USB      0x00000010u
#define POWER_WAKE_ETH_LINK 0x00000020u
#define POWER_WAKE_MASK_SUPPORTED \
    (POWER_WAKE_RTC | POWER_WAKE_GPIO | POWER_WAKE_TIMER)
#define POWER_WAKE_MASK_HW_GATED \
    (POWER_WAKE_UART_RX | POWER_WAKE_USB | POWER_WAKE_ETH_LINK)

/* RTC wakeup timer LSB: with IRC32K (~32 kHz internal) clock and
 * the /16 divider, the timer ticks at 32000/16 = 2000 Hz -- 0.5 ms
 * per tick.  Max wake = 65535 / 2000 = 32.7 s.  Longer waits would
 * need the CKSPRE_2EXP16 mode which sits in a future commit. */
#define POWER_WAKE_LSB_HZ        2000u
#define POWER_WAKE_TIMER_MAX_MS  (65535u * 1000u / POWER_WAKE_LSB_HZ)

