alplabai/gd32-bridge-firmware/hal/bridge_hw_gd32.c
typedef struct {
    uint8_t  kind;           /* alp_dsp_stage_kind_t (valid when total_size > 0) */
    uint16_t total_size;     /* declared in first chunk; locks for the stage    */
    uint16_t bytes_received; /* running count toward total_size                  */
    bool     complete;       /* bytes_received == total_size                     */
    uint8_t  data[BRIDGE_DSP_MAX_STAGE_BYTES];
} adc_dsp_stage_t;

typedef struct {
    bool            in_use;
    bool            bound;
    adc_dsp_stage_t stages[BRIDGE_DSP_MAX_STAGES];
} adc_dsp_chain_t;

/* 4 chains x 4 stages x 260 B = 4160 bytes of stage-data RAM + ~80
 * bytes of metadata; well inside the GD32G553's 128 KB SRAM. */
static adc_dsp_chain_t adc_dsp_chains[BRIDGE_DSP_MAX_CHAINS];

int bridge_hw_adc_dsp_chain_open(uint8_t *chain_id)
{
    if (chain_id == 0) return BRIDGE_HW_ERR_INVAL;
    *chain_id = 0u;

    /* First-fit search over the chain pool.  The pool is small (4
     * entries today) so the linear scan is comfortably faster than
     * any free-list bookkeeping would be; if the pool grows, this
     * function is the natural place to add a free-list head. */
    for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_CHAINS; ++i) {
        if (!adc_dsp_chains[i].in_use) {
            /* Zero the chain state so a previously-released chain
             * doesn't leak stale stage data into the new allocation. */
            for (uint8_t s = 0u; s < BRIDGE_DSP_MAX_STAGES; ++s) {
                adc_dsp_chains[i].stages[s].kind           = 0u;
                adc_dsp_chains[i].stages[s].total_size     = 0u;
                adc_dsp_chains[i].stages[s].bytes_received = 0u;
                adc_dsp_chains[i].stages[s].complete       = false;
            }
            adc_dsp_chains[i].in_use = true;
            adc_dsp_chains[i].bound  = false;
            *chain_id                = i;
            return BRIDGE_HW_OK;
        }
    }
    /* Pool exhaustion.  Protocol layer maps BRIDGE_HW_ERR_NOTIMPL to
     * STATUS_NOSUPPORT today; a STATUS_NOMEM-equivalent would be
     * more accurate but doesn't exist on the wire yet. */
    return BRIDGE_HW_ERR_NOTIMPL;
}

int bridge_hw_adc_dsp_stage_push(uint8_t chain_id, uint8_t stage_index, uint8_t kind,
                                 uint16_t chunk_offset, uint16_t chunk_total_size,
                                 const uint8_t *chunk_data, size_t chunk_data_len)
{
    if (chain_id >= BRIDGE_DSP_MAX_CHAINS) return BRIDGE_HW_ERR_RANGE;
    if (stage_index >= BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_RANGE;
    if (kind > BRIDGE_DSP_KIND_MAX) return BRIDGE_HW_ERR_INVAL;
    if (chunk_total_size == 0u) return BRIDGE_HW_ERR_INVAL;
    if (chunk_total_size > BRIDGE_DSP_MAX_STAGE_BYTES) return BRIDGE_HW_ERR_RANGE;
    if (chunk_data_len == 0u || chunk_data == 0) return BRIDGE_HW_ERR_INVAL;
    /* `chunk_offset + chunk_data_len <= chunk_total_size` -- guard
     * against integer overflow on the addition (both inputs are
     * 16-bit-bounded above) by doing the subtraction. */
    if (chunk_data_len > (size_t)(chunk_total_size - chunk_offset)) return BRIDGE_HW_ERR_RANGE;

    adc_dsp_chain_t *chain = &adc_dsp_chains[chain_id];
    if (!chain->in_use) return BRIDGE_HW_ERR_INVAL;
    if (chain->bound) return BRIDGE_HW_ERR_INVAL; /* mutation after bind */

    adc_dsp_stage_t *st = &chain->stages[stage_index];

    if (chunk_offset == 0u) {
        /* First chunk of this stage.  Seed `kind` + `total_size`;
         * any subsequent chunks must agree with these values so a
         * mid-upload re-target of the stage is caught as INVAL. */
        st->kind           = kind;
        st->total_size     = chunk_total_size;
        st->bytes_received = 0u;
        st->complete       = false;
    } else {
        /* Continuation chunk.  The host must keep the same kind +
         * total_size as the first chunk of this (chain, stage)
         * pair -- otherwise the buffer would be a mix of two
         * different stage payloads. */
        if (st->total_size == 0u) return BRIDGE_HW_ERR_INVAL; /* stage not yet opened */
        if (st->kind != kind) return BRIDGE_HW_ERR_INVAL;
        if (st->total_size != chunk_total_size) return BRIDGE_HW_ERR_INVAL;
        if (st->complete) return BRIDGE_HW_ERR_INVAL; /* already done */
    }

    for (size_t i = 0u; i < chunk_data_len; ++i) {
        st->data[chunk_offset + i] = chunk_data[i];
    }
    st->bytes_received += (uint16_t)chunk_data_len;
    if (st->bytes_received == st->total_size) {
        st->complete = true;
    }
    return BRIDGE_HW_OK;
}

int bridge_hw_adc_dsp_chain_bind(uint8_t chain_id, uint8_t stream_id)
{
    if (chain_id >= BRIDGE_DSP_MAX_CHAINS) return BRIDGE_HW_ERR_RANGE;
    if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;

    adc_dsp_chain_t *chain = &adc_dsp_chains[chain_id];
    if (!chain->in_use) return BRIDGE_HW_ERR_INVAL;
    if (chain->bound) return BRIDGE_HW_ERR_INVAL; /* already attached */

    /* Validate every populated stage is complete + the chain
     * follows the ordering rules documented in
     * `bridge_hw_adc_dsp_chain_bind`'s contract:
     *   - FFT must be the terminal stage (no stage after it),
     *   - WINDOW must immediately precede FFT,
     *   - empty stages (total_size == 0) are allowed only at
     *     contiguous tail positions -- not interleaved with
     *     populated stages. */
    uint8_t fft_index    = BRIDGE_DSP_MAX_STAGES;
    uint8_t window_index = BRIDGE_DSP_MAX_STAGES;
    uint8_t last_populated_index = BRIDGE_DSP_MAX_STAGES;
    for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
        adc_dsp_stage_t *st = &chain->stages[i];
        if (st->total_size == 0u) continue;
        if (!st->complete) return BRIDGE_HW_ERR_INVAL; /* mid-upload */
        if (last_populated_index != BRIDGE_DSP_MAX_STAGES &&
            (uint8_t)(i - last_populated_index) != 1u) {
            return BRIDGE_HW_ERR_INVAL; /* gap in stage list */
        }
        last_populated_index = i;
        if (st->kind == 3u /* FFT */) {
            if (fft_index != BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_INVAL;
            fft_index = i;
        } else if (st->kind == 2u /* WINDOW */) {
            if (window_index != BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_INVAL;
            window_index = i;
        }
    }
    if (last_populated_index == BRIDGE_DSP_MAX_STAGES) {
        return BRIDGE_HW_ERR_INVAL; /* empty chain */
    }
    if (fft_index != BRIDGE_DSP_MAX_STAGES) {
        /* FFT must be terminal -- no populated stage after it. */
        if (fft_index != last_populated_index) return BRIDGE_HW_ERR_INVAL;
        /* WINDOW (if present) must directly precede the FFT. */
        if (window_index != BRIDGE_DSP_MAX_STAGES &&
            (fft_index == 0u || window_index != fft_index - 1u)) {
            return BRIDGE_HW_ERR_INVAL;
        }
    } else if (window_index != BRIDGE_DSP_MAX_STAGES) {
        /* WINDOW without a terminating FFT has no defined meaning in
         * the filtered-samples path -- reject per docs/gd32-bridge-
         * protocol.md §3.x. */
        return BRIDGE_HW_ERR_INVAL;
    }

    adc_stream_state_t *s = &adc_streams[stream_id];
    if (!s->in_use) return BRIDGE_HW_ERR_INVAL; /* stream not running */
    if (s->dsp_bound) return BRIDGE_HW_ERR_INVAL; /* stream already has a chain */

    /* Attachment is a state flip on both halves.  Runtime DSP
     * application happens inside stream_read once the wave-2 FFT/FAC
     * dispatch lands; for now the bound chain simply rides alongside
     * the raw stream and the host sees raw mV values until the
     * dispatcher hook ships. */
    s->dsp_chain_id = chain_id;
    s->dsp_bound    = true;
    chain->bound    = true;
    return BRIDGE_HW_OK;
}
